[
    "\n\nAge Progression\n\n\nWhen a character is rapidly progressing in age during the story. For any possible reason: Magic, Time, by use of a machine etc.\n\n",
    "\n\nAge Regression\n\n\nThe opposite of Age Progression. When a character is rapidly regressing in age during the story. For any possible reason: Magic, Time, by use of a machine etc.\n\n",
    "\n\nAhegao\n\n\nExaggerated lust-filled expression mostly occurring during a sexual climax (e.g: flushed cheeks, heavy breathing, eyes tearing/rolling upwards into the head, excessive sweating, drooling saliva, tongue hanging out )\n\n",
    "\n\nAlien\n\n\nScenes featuring a creature coming from outer space and possessing intelligence.\n\n",
    "\n\nAll the Way through\n\n\nAn object is inserted into the ass and goes all the way through the body, coming out in the mouth, or vice versa. Most commonly it's tentacles.\n\n",
    "\n\nAmputee\n\n\nA character missing one or more limbs.\n\n",
    "\n\nAnal\n\n\nRefers to sexual acts involving the insertion of an object into the anus.\n\n",
    "\n\nAngel\n\n\nBeings possessing angelic wings and/or an angelic aura. May also refer to any character resembling a deity or a divine being.\n\n",
    "\n\nAnilingus\n\n\nSexual stimulation involving oral contact with the anus.\n\n",
    "\n\nAnimal Boy\n\n\nA boy who is half human, half animal. Encompasses dog boys, cat boys, mouse boys, etc.\n\n",
    "\n\nAnimal Girl\n\n\nA girl who is half human, half animal. Usually tied with a tag like Fox Girl, Cat Girl, etc.\n\n",
    "\n\nAnimated\n\n\nA gallery contains animated images, mostly from Eroge.\n\n",
    "\n\nAnthology\n\n\nA magazine with various chapters from various artists.\n\n",
    "\n\nApp\n\n\nA book where the MC uses a app for sexual purposes, this can be with magical means or not depending on what the app does.\n\n",
    "\n\nArachne\n\n\nA monster/animal hybrid that is half spider and half human. should be tagged with monster girl/animal girl.\n\n",
    "\n\nArmpit\n\n\nMay refer to any sexual act involving the armpits or a particular focus on them.\n\n",
    "\n\nArtbook\n\n\nA collection of images and graphics of a given topic from a published book\n\n",
    "\n\nAsphyxiation\n\n\nThe intentional restriction of oxygen to the brain, often for sexual arousal through strangling, hanging, deepthroat etc.\n\n",
    "\n\nAssjob\n\n\nRubbing a penis between butt cheeks. Also called \"Hotdogging\".\n\n",
    "\n\nAunt\n\n\nAn aunt is having sex with her nephew or niece. Must be used along with Incest.\n\n",
    "\n\nAutofellatio\n\n\nThe act of sucking yourself. Usually requires and appears along with the \"Huge Penis\" tag.\n\n",
    "\n\nBand-Aid / Pasties\n\n\nUsing a band-aid, pasties or similar objects to cover the genitals, could be the nipples or pussy or both.\n\n",
    "\n\nBathroom Sex\n \n\nIntercourse initiated within a bathroom. Includes public restrooms and office rest rooms. Any bathroom is acceptable.\n\n",
    "\n\nBBM / Fat Man\n\n\nThis is the male equivalent for \"BBW\", with the difference that the majority of them aren't beautiful at all and even more ugly on the inside than on the outside.\n\n",
    "\n\nBBW\n\n\nAbbreviation for \"Big Beautiful Woman\". A girl / woman who may be considered overweight or fat.\n\n",
    "\n\nBDSM\n\n\nShort for \"Bondage & Discipline, Dominance & Submission, Sadism & Masochism\". A lifestyle with one partner being the dominant one and the other one being submissive. Doesn't necessitate the Bondage tag, but often appears alongside with it.\n\n",
    "\n\nBestiality\n\n\nRefers to sexual relations between a human and an animal. Do not use this tag for monsters, monster girls or furries.\n\n",
    "\n\nBig Areola\n\n\nBreasts with enormous areolae. They should be roughly as big as a third of the breast's surface or larger to qualify for this tag.\n\n",
    "\n\nBig Ass\n\n\nAs the name says, asses that are very large. Used most commonly along with the BBW and MILF tags. Size estimate to qualify: Roughly double the head size of the character.\n\n",
    "\n\nBikini\n\n\nA two-piece swimwear covering the breasts and genitals. Use this tag along with the \"Swimsuit\" tag since it's also a type of Swimsuit.\n\n",
    "\n\nBirth\n\n\n A woman giving birth to a living creature, whether it's human or not. Don't use this for \"Egg Laying\"\n\n",
    "\n\nBisexual\n\n\nA character has sex with both the same and opposite genders. Do not use this for threesomes or other group sex scenes unless the characters of the same gender are heavily interacting with each other.\n\n",
    "\n\nBlackmail\n\n\nA character is being forced into providing sexual favors through threat or disclosing information.\n\n",
    "\n\nBlindfold\n\n\nRefers to a character whose sight is obstructed by an object (e.g: a piece of cloth, mask, ... ).\n\n",
    "\n\nBlindness\n\n\nRefers to a character who lost its sight.\n\n",
    "\n\nBloomers\n\n\nGym garments often worn by Japanese schoolgirls. Needs to be tagged along 'Sportswear' tag.\n\n",
    "\n\nBlowjob\n\n\nUsing the mouth to stimulate pleasure on your partner by sucking/licking his (or her in the case of Futas) penis.\n\n",
    "\n\nBody Modification\n\n\nAltering parts of the body in some artificial way, typically with technology. Not to be used for Gender Bending or futas. Able to be tagged with shemale as long as mentioned they undergone a surgery.\n\n",
    "\n\nBody Painting\n\n\nPainting a body, mostly to simulate pieces of clothing. Don't confuse this with \"Body Writing\" or \"Tattoos\"\n\n",
    "\n\nBody Swap\n \n\nBody swap occurring between the characters of the story. Most common between a man and a woman.\n\n",
    "\n\nBody Writing\n\n\nVarious words or drawings made on the person's body, usually include derogatory terms such as \"slut\" or \"cum dumpster\" Don't confuse this with \"Body Painting\" or \"Tattoos\".\n\n",
    "\n\nBodysuit\n\n\nAny full-body suit that is form-fitting; must cover the arms and legs.\n\n",
    "\n\nBondage\n\n\nBondage is the act of tying, binding, or restraining a partner for erotic, aesthetic, and/or somatosensory stimulation. Various items can be used such as rope, cuffs, tape, tentacles or other restraints.\n\n",
    "\n\nBraids\n\n\nA girl (usually) has interweaving braids.\n\n",
    "\n\nBrain Fuck\n\n\nPenetrating the brain. Can also be used when the character's brain is being messed with to either manipulation, or sexual stimulation purposes. Usually tied with Ear Fuck, Mind Control, Parasite tags.\n\n",
    "\n\nBreast Expansion\n\n\nExpansion of breasts, mostly due to magic, drugs or other means.\n\n",
    "\n\nBreast Sucking\n\n\nSucking on a pair of breasts, regardless of shape and size.\n\n",
    "\n\nBukkake\n\n\nA fetish that involves repeated ejaculation on a person, often by many people at once.\n\n",
    "\n\nBullying\n\n\nVerbal or Physical harassment towards a person with inferior status.\n\n",
    "\n\nBunnygirl\n\n\nEither a bunny and human hybrid or a character wearing a bunny girl outfit. Tagged with animal boy or girl depending on the gender of the bunny hybrid. Needs to be tagged with cosplay or a animal boy/girl tag.\n\n",
    "\n\nButler\n\n\nA domestic worker, often serving rich families in large households. Often wears a tuxedo with a tie or bowtie.\n\n",
    "\n\nCatgirl\n\n\nEither a Feline and human hybrid or a character wearing a cat girl outfit. Can be tagged with animal boy or girl depending on the gender of the Feline hybrid. Needs to be tagged with cosplay or a animal boy/girl tag.\n\n",
    "\n\nCBT\n\n\nCBT stands for \"Cock and Ball Torture\". Torture can be inflicted by: Slapping, Squeezing, Pinching, Weights, etc. The testicles can stand great pain but caution should be taken.\n\n",
    "\n\nCentaur/Horsegirls\n\n\nEither a horse and human hybrid with a horse body or a human body and horse tail and ears. tagged with animal boy/girl or monster/ monster girl depending on the gender and the form the horse hybrid is shown in.\n\n",
    "\n\nCervical Penetration\n\n\nPenetration of the cervix. Awesome in Hentai, but don't try this at home. NOTE: Has to be tagged with X-Ray tag.\n\n",
    "\n\nChastity Belt\n\n\nA belt usually used by boys or girls that intend to maintain their virginity. In Hentai however it's mainly used by their partners to ensure that they only have sex or masturbate when they're allowed to. Often appears alongside the \"BDSM\" tag.\n\n",
    "\n\nCheating\n\n\nThe cheating tag is used for content where one of the characters has sex with someone other than their partner. Often we are not introduced to the partner, or they have a very small part in the story.\n\n",
    "\n\nCheerleader\n\n\nA person involved in cheerleading. This sport, while negatively associated with unfavorable personalities, demands rigorous athleticism, spirit, and team-work.\n\n",
    "\n\nChikan\n\n\nChikan is the Japanese word for public molestation. Usually used for content that features groping and sexual assaults that take place in crowded public trains or other public places.\n\n",
    "\n\nChildhood Friend\n\n\nA friend that the protagonist has known since childhood days.\n\n",
    "\n\nChinese Dress\n\n\nA body-hugging one-piece dress, usually adorned with a simple or floral pattern.\n\n",
    "\n\nChristmas\n\n\nA character is wearing or cosplaying with a Christmas or Santa outfit.\n\n",
    "\n\nCollar/Choker\n\n\nA character is either wearing a dog collar or the thin cloth neck wear.\n\n",
    "\n\nComedy\n\n\nDoujins/Mangas that have a good amount of humor (not just a single line of humorous dialogue).\n\n",
    "\n\nCondom\n\n\nSex using a condom (usually to prevent the partner from getting pregnant).\n \n",
    "\n\nConfined\n\n\nSexual acts are happening in a confined space. this can be in lockers, closet, kotatsu, or even wrapped up in blankets. note not to be tagged with vore.\n\n",
    "\n\nCorruption\n\n\nCorrupting someone's mind forcefully with magic or other supernatural powers, robbing them of their purity. It can occur along with Transformation, Monster Girl, and Devil tags.\n\n",
    "\n\nCosplay\n\n\nCosplay is a tag used for a person dressing up in costume or fashion to represent a specific character or idea. This tag encompasses various forms of costume play including bunny girl, maid, teacher, nurse, anime/game characters, original characters, etc.\n\n",
    "\n\nCousin\n\n\nAny sexual situation between cousins. It must be used along with the Incest tag.\n\n",
    "\n\nCow Girl\n\n\nHalf human, half cow or a character wearing a cow outfit. Not to be confused with the sex position. Can be tagged with animal boy or girl depending on the gender of the cow hybrid. Needs to be tagged with cosplay or a animal boy/girl tag.\n\n",
    "\n\nCrossdressing\n\n\nA boy using girl's clothes or a girl using male clothes. Oftentimes forced into them by someone dominant.\n\n",
    "\n\nCrotchless / Breastless\n\n\nAny kind of clothing that is crotchless or breastless, most commonly by having holes in these places. Some kinds of Bondage Gear apply for this tag as well.\n\n",
    "\n\nCum Swap\n\n\nThe exchanging of cum between two people usually mouth to mouth but can also come in other variations such as from the vagina to the mouth, commonly seen in threesomes.\n\n",
    "\n\nCumdump\n\n\nA character is used as a public human toilet to relieve sexual stress of other people. Mostly occurs in schools.\n\n",
    "\n\nCunnilingus\n\n\nCunnilingus is the act of performing oral on the female genitals. This can be a form of sexual foreplay or as an intimate sexual act on its own.\n\n",
    "\n\nDancer\n\n\nA person either preforming a dance or wearing specific dancing clothes. Note: should not be tagged with idol.\n\n",
    "\n\nDandere\n\n\nA dandere is a character archetype that entails someone being quiet which is usually associated with shyness. \"Dan\" comes from the word \"danmari\" which means silent and taciturn. \"Dere\" means to become \"lovey dovey\". Not to be confused with Kuudere which is a cool person that becomes lovey dovey.\n\n",
    "\n\nDark Skin\n\n\nRefers to a person with a brown or black skin tone. This tag should only be used for naturally dark skin. Don't use it for tanned characters.\n\n",
    "\n\nDecensored\n\n\nA work that was decensored by fans. Don't confuse this with the \"Uncensored\" tag that has original uncensored art by the artist.\n\n",
    "\n\nDeepthroat\n\n\nThe same as blowjob, but going deep down the throat.\n\n",
    "\n\nDefloration\n\n\nThe act of a female losing their virginity. Frequently includes minor bleeding.\n\n",
    "\n\nDelinquent\n\n\nA young person who fails to do that which is required by law or has the typical appearance of one.\n\n",
    "\n\nDelusion\n\n\nSex scenes that haven't actually happened in the character's reality, e.g: Dreams, fantasies, big delusions that end when the character wakes up or snaps back to reality. Can also be used when the person is seeing their loved one having sex when it is actually someone they don't know (most times drug induced). Usually tied with Drugs, Solo Action and/or Masturbation tags.\n\n",
    "\n\nDemon | Incubus\n\n\nDemons! Male beings with pointy horns, a pointy tail and the desire to... read you a bed time story. Can be used for any kind of male demon, Incubi included.\n\n",
    "\n\nDemon Girl | Succubus\n\n\nA female demon that appears in dreams and takes the form of a woman in order to seduce men. In Hentai tough, it's more like a devil girl that has the same objective. Can be used for any kind of female demon, not only succubi.\n\n",
    "\n\nDiaper\n\n\nA disposable diaper, or cloth with plastic pants... used for babies, toddlers, children, adults, and old people. Not to be used to treat the lazy ones.\n\n",
    "\n\nDick Growth\n\n\nWhen a girl grows one or more male genitals.\n\n",
    "\n\nDILF\n\n\nShort for \"Daddy I'd Like to Fuck\". The male variant of the MILF tag. Use this for attractive males that appear to be at least 30+ years old. Don't use it for ugly and fat bastards. Those get the \"Dirty Old Man\" and / or \"Fat Man\" tags.\n\n",
    "\n\nDoctor\n\n\nA person who is qualified to treat people who are ill. This can range from nurses to surgeons.\n\n ",
    "\n\nDog\n\n\nA dog engages in sex. Should only be used for actual dogs, not furries or animal boys / girls. Has to be used alongside the Bestiality tag.\n\n",
    "\n\nDog Girl\n\n\nEither a Canine and human hybrid or a character wearing a dog girl outfit. Can be tagged with animal boy or girl depending on the gender of the Canine hybrid. Needs to be tagged with cosplay or a animal boy/girl tag.\n\n",
    "\n\nDojikko\n\n\nA character who is an air head. Their klutziness usually hurts other people more than themselves.\n\n",
    "\n\nDoll\n\n\nAnything ranging from a love doll, mechanical android, robot girl to your daughter's teddy bear.\n\n",
    "\n\nDouble Penetration\n\n\nInsertion of objects or genitals within another, but double the usual amount. An example would be a penis in the vagina as well as a jar of mayonnaise in the fartbox.\n\n",
    "\n\nDragon Girl\n\n\nA monster that is half dragon and half human. To be tagged with monster/monster girl depending on the gender along with the reptilian tag.\n\n",
    "\n\nDrugs\n\n\nDrugs are used to get a character in a certain state, for example sexual arousal ecstasy or sleep. Also used for aphrodisiacs.\n\n",
    "\n\nDrunk\n\n\nHaving sex with a drunk person.\n\n",
    "\n\nEgg Laying\n\n\n KILL IT BEFORE IT LAYS EGGS! Kidding. Some sort of pregnancy or drug induced woman (or man) laying eggs.\n\n",
    "\n\nElder Brother\n\n\nSexual relations between an older brother and their younger siblings\n\n",
    "\n\nElder Sister\n\n\nSexual relations occurring between a sibling (regardless of gender) and an older sister. Admit it, some of you guys have a huge thing for this.\n\n",
    "\n\nElf\n\n\nA human-like creature that has pointy ears. Usually revolves around magic. And rape. Can't spell \"Elf\" without \"Rape\".\n\n",
    "\n\nEmotionless Sex\n\n\nWhen the character having sex isn't fazed by it or apathetic to it. An example would be Rei Ayanami from NGE.\n\n",
    "\n\nEnema\n\n\nThe process of pouring water into a rectum. This can be therapeutic (to relieve constipation), for cleanliness (to clean the rectum before anal sex), or erotic (some people receive pleasure from the sensation of having a full bowel). Usually involves scat.\n\n",
    "\n\nExhibitionism\n\n\nExtravagant behaviour that is intended to attract attention to oneself characterized by the compulsion to display one's genitals or having sex in public.\n\n",
    "\n\nEyepatch\n\n\nInvolves an eye patch to conceal an eye... Or two.\n\n",
    "\n\nFace Sitting\n\n\nSitting on another persons face. Usually involves licking of genitalia.\n\n",
    "\n\n Fairy\n\n\nA humanoid creature with magical powers and sometimes butterfly wings. Fairies can be any size from the size of a seed to human size. Known to be pranksters, it is best not to get on their bad side.\n\n",
    "\n\nFangs\n\n\nA character that has pointy teeth. Generally it applies for Vampires, Succubi and/or Animal Girls/Boys, but it can also just be present on some moe character.\n\n",
    "\n\nFather\n\n\nSexual contact between a child and it's father. Don't use this tag if a man just happens to be a father and his children aren't involved in the sex scenes\n\n",
    "\n\nFemales only\n\n\nThere are only females engaged in sexual acts either with themselves or with other females. No guys are butting in the sexual scenes anywhere. Use it along with the \"Yuri\" tag (Or not if it's Non-H). NOTE: Futas and Shemales don't count for this tag.\n\n",
    "\n\nFemdom\n\n\nFemdom, the shortened term for female dominance, refers to relationships or sexual scenes where the dominant partner is female. This is frequently associated with BDSM or S&M. Manga with this tag contain female characters that are assertive and dominant over the other partner.\n\n",
    "\n\nFilming\n\n\nTaking pictures or filming sexual intercourse and/or masturbation, in order to show it to someone or not.\n\n",
    "\n\nFingering\n\n\nInsertion of fingers into another person, usually in the butthole or vagina. Can also include the penis hole. Weird.\n\n",
    "\n\nFisting\n\n\nInsertion of the fist into ones fartbox or vagina. This can include the urethra of the penis. Trust me, I have seen some fucked up shit.\n\n",
    "\n\nFlat Chest\n\n\nA female that has very little to no chest, applies for all ages. Not to be tagged with small breasts.\n\n",
    "\n\nFoot Fetish\n\n\nThis tag involves sexual activities with the feet such as Licking. Usually tied with footjobs. Tweety's favourite.\n\n",
    "\n\nFootjob\n\n\nFeet being used to stimulate sexual arousal, including but not limited to handjobs via foot. What did you expect?\n\n",
    "\n\nForeigner\n\n\nOne of the main characters isnt from the country where the dj is involved and/or has foreign blood.\n\n",
    "\n\nForniphilia\n\n\nHumans being turned and used as Furniture or other inanimate objects such as onaholes or toilets. Can be associated with 'Amputee', 'Onahole', 'Human Toilet', 'Mind Control', 'Mind Break', 'Monster', 'Petrification' and 'Transformation' tags. Needs to be tagged along with the 'Body Modification' tag.\n\n",
    "\n\nFox Girl\n\n\nA character having the features of a fox usually with multiple, beautiful, fluffy tails and long pointed ears. Tagged with animal boy or girl depending on the gender of the fox hybrid.\n\n",
    "\n\nFreckles\n\n\nThe brownish spots on the skin that are caused by exposure to sunlight. Redheaded people often possess it.\n\n",
    "\n\nFrench Kissing\n\n\nWhen two characters are kissing with tongues, must show the tongues intertwining with each other either with x-ray or outside of each others mouth. Any amount of French kissing applies.\n\n",
    "\n\nFrotting\n\n\nThe act of rubbing penises against each other or objects. Mostly seen in Futa doujins.\n\n",
    "\n\nFull Color\n\n\nThe full color tag refers to anything entirely in color. Usually full color releases are much more elaborate and more detailed than regular releases and as a result they are much shorter.\n\n",
    "\n\nFundoshi\n\n\nRefers to traditional Japanese underwear . Not sexy enough to be regarded as a piece of lingerie.\n\n",
    "\n\nFurry\n\n\nRefers to anthromorphic animals possessing human personalities and characteristics.\n\n",
    "\n\nFuta on Female\n\n\nA sexual situation between a Futanari girl and a female. NOTE: This tag also applies for Shemales on girls.\n\n",
    "\n\nFuta on Male\n\n\nA girl with a dick is penetrating a male. This tag includes BOTH Futanari and Shemales.\n\n",
    "\n\nFutanari\n\n\nGirls that have both a penis and a vagina.\n\n",
    "\n\nFutanari on Futanari\n\n\nA girl with a dick fucking another girl possessing a dick. This tag includes BOTH Futanari and Shemales.\n\n",
    "\n\nGangbang\n\n\nGangbangs involve one person(guy, girl, futa) being on the receiving end of at least 3 other people (guy or futa). NOTE: All Gangbang galleries also require the Group Sex tag.\n\n",
    "\n\nGaping\n\n\nA vagina or anus that is visibly stretched before or after sex, by any means. Do not confuse this with the 'Spreading' tag. Can be associated with the 'Huge Penis' and 'Sex Toys' tags.\n\n",
    "\n\nGender Bender\n\n\nCharacters that switched their gender from male to female or vice versa, often with magical means.\n\n",
    "\n\nGhost\n\n\nSomeone who has passed away and came back as a flying bedsheet. You know what I mean.\n\n",
    "\n\nGiantess/Giant\n\n\nA Giant person.\n\n",
    "\n\nGlory Hole\n\n\nReceiving sexual stimulation (Blowjobs, Handjobs), or having sexual intercourse through a hole in a wall. Do not confuse\nthis with 'Stuck in Wall' or 'Wormhole' tags.\n\n",
    "\n\nGloves\n\n\nSimilar to stockings, but gloves are worn on arms. They are often worn by brides.\n\n",
    "\n\nGokkun\n\n\nThe act of drinking the cum of the partner after the act. Don't tag this for generic blowjobs. There should be a clear focus on the act of drinking the semen, e.g. by drinking it from a cup. Also used for eating food sprinkled with delicious white sauce\n\n",
    "\n\nGothic\n\n\nThis tag is used for clothing styles that are typically dark, sometimes morbid, eroticized fashion, usually borrowed from Elizabethan and Victorian dresses. Goth fashion can be recognized by its stark black clothing (or hair or makeup), often contrasted with boldly colored clothing, hair and makeup in shades of deep reds, purples, blues or emerald green, lace, silks, and high heels for either gender.\n\n",
    "\n\nGrandFather\n\n\nA male that has sex with at least one of his grandchildren. Use this tag in conjunction with Incest.\n\n",
    "\n\nGrandmother\n\n\nA female that has sex with at least one of her grandchildren. Use this tag in conjunction with Incest.\n\n",
    "\n\nGroup Sex\n\n\nGroup sex involves sexual contact between at least 3 people, regardless of gender... And species. Doujins tagged with \"Threesome\" get this tag as well.\n\n",
    "\n\nGuro\n\n\nGuro is essentially grotesque pornography, more common in hentai and Go Nagai anime. Extreme examples of Guro include necrophilia, amputee sex, skull-fucking and violent rape.\n\n",
    "\n\nGyaru\n\n\nGyaru, taken from the English word gal, is a type of Japanese street fashion typically characterized by heavy make-up, dyed or bleached hair, and sometimes tanned skin. This form of style and fashion, which is influenced partly by Western materialism has been seen as childish or rebellious in relation to traditional Japanese culture.\n\n",
    "\n\nHairjob\n\n\nUsing the hair to stimulate pleasure on ones partner. Mostly done by wrapping the hair around the dick.\n\n",
    "\n\nHairy\n\n\nA character has excessive and a noticeable amount of pubic hair.\n\n",
    "\n\nHairy Armpits\n\n\nArmpits.. Hair.. Hair.. Armpits. Hopefully I don't need to explain in depth.\n\n",
    "\n\nHandjob\n\n \nUsing the hand to jerk off your partner. Do not confuse this with Masturbation, where one use his own hand to stimulate him/herself.\n\n",
    "\n\nHappy Sex\n\n\nDefinitely not sad sex. When both parties are happy in engaging in whatever the hell they're doing and like each other very much.\n\n",
    "\n\nHarem\n\n\nHarem is a sub-genre of anime and manga characterized by a protagonist surrounded by three or more members of the opposite sex. The most common scenario is a male surrounded by multiple female partners, with each female personifying a popular character type. When the situation is reversed and there is one female surrounded by males, it is referred to as a reverse harem.\n\n",
    "\n\nHarpy\n\n\nA monster/animal hybrid that is half bird and half human. To be tagged with monster girl/animal girl.\n\n",
    "\n\nHat\n\n\nA character is wearing a hat while having sex (or not for Non-H galleries). This tag includes all kinds of hats, from witch hats to caps to beanies, etc.\n\n",
    "\n\nHeterochromia\n\n\nRefers to a person with both eyes having different colors. A popular example is Yuna from Final Fantasy X.\n\n",
    "\n\nHidden Sex\n\n\nEngaging in sexual acts while near or around other people in a discreet or hidden manner.\n\n",
    "\n\nHorse\n\n\nA horse engages in sex. Should only be used for actual horses, not furries or centaurs. Has to be used alongside the Bestiality tag.\n\n",
    "\n\nHotpants\n\n\n Hotpants are shorts that could not possibly be shorter. So short, your labia would probably be visible. I speak of experience since I visit the local park 4 times a week.\n\n",
    "\n\nHousewife\n\n\nA married woman whose main occupation is caring for her family, managing household \"affairs\", and doing housework.\n\n",
    "\n\nHuge Breasts\n\n\nReally enormous breasts that ultrapass the reality and the physics! They need to be at least twice as big as the girl's head to qualify for this tag. NOTE: All \"Huge Breasts\" doujins also get the \"Large Breasts\" tag by default. If you don't want to see them, exclude Huge Breasts when searching for Large Breasts.\n\n",
    "\n\nHuge Penis\n\n\nA penis that would feel painful if it was in your ass. A large penis, if you will. Generally 7+ inches long (or 17.78+ centimeters for anyone using the metric system like an intelligent human being).\n\n",
    "\n\nHuman Cattle\n\n\nHuman beings kept as livestock, usually for milking and/or breeding. Often involves bondage.\n\n",
    "\n\nHumiliation\n\n\nWhen a character is forcefully exposed to some audience and has to do embarrassing things. Can be used along with the Exhibitionism tag (or not).\n\n",
    "\n\nHypnosis\n\n\nVery similar to Mind Control. However, it works by implanting suggestions.\n\n",
    "\n\nIdol\n\n\nWorks which predominantly feature Idols. Idols are characterized as young, cute girls famous for their singing, dancing, and fashion.\n\n",
    "\n\nImmersed/Submerged\n\n\nBooks where the characters are performing sexual acts with at least half of their bodies in or underwater.\n\n",
    "\n\nImouto\n\n\nImouto is the Japanese term for a little sister. Can be sex between an older girl and her younger sister, or an older brother and his younger sister.\n\n",
    "\n\nImpregnation\n\n\nThe act of impregnating a female by having one of her egg cells fertilized. Only use this tag if impregnation is visually shown (e.g. via X-Ray, or a pregnant belly or baby after a timeskip) or if it's heavily implied in the dialogue (e.g. the girl saying that it's a very dangerous day for her). DON'T use it if one of the characters just shouts \"Get pregnant\" or \"I will get pregnant!\" at the end.\n\n",
    "\n\nIncest\n\n\nTwo characters play a game together that the whole family can enjoy. A family that fucks together stays together, after all. This tag is used both for characters that are blood related, and not blood related. If you want to only see blood-related Incest, exclude \"Inseki\" from the search.\n\n",
    "\n\nInfantilism\n\n\nRoleplay involving treating a non-child partner as though they were an infant. Needs to be tagged with Roleplay\n\n",
    "\n\nInflation\n\n\nA character is pumped so full of cum (or something else), making their body swell up. Can be tagged alongside 'Cervical Penetration' and 'Enema'.\n\n",
    "\n\nInsect\n\n\nBugs or insect like creatures engage in sex. Do not use this tag for Insect Girls. Has to be used alongside the bestiality and monster tags.\n\n",
    "\n\nInsect Girl\n\n\nA monster/animal hybrid that is half human, half insect. Arachnids aren't insects, so don't confuse this for Arachne. Needs to be tagged along with the monster/Monster Girl/and animal boy/animal girl tag.\n\n",
    "\n \nInseki\n\n\nSiblings or parents that are not blood-related (in-laws or stepsiblings) have sex with each other. NOTE: This also requires the \"Incest\" tag. If you only want blood-related Incest, exclude this tag from your search.\n\n",
    "\n\nInverted Nipples\n\n\nNipples that are retracted inside the breasts. Often brought out via stimulation or pulling.\n\n",
    "\n\nInvisible\n\n\nA character is invisible or not noticed by his surroundings by other means, e.g. magic.\n\n",
    "\n\nIrrumatio\n\n\nThe male counterpart is thrusting into the recipient by himself. Literally face fucking.\n\n",
    "\n\nIsekai\n\n\nA person gets transported or summoned to another world.\n\n",
    "\n\nJosou Seme\n\n\nWhen a girly boy takes the lead in sex. Requires the 'Crossdressing' and/or 'Trap' tags. More prominent in 'Yaoi' content.\n\n",
    "\n\nKimono / Yukata\n\n\nA cool, traditional robe originating from Japan. It's usually made of silk and feels like heaven! They have existed for hundreds of years in some form and are so cool! NOTE: This tag includes both Kimonos and Yukatas, which are a type of Kimono.\n\n",
    "\n\nKotatsu\n\n\nWhen the characters are having sex in, around, or on a kotatsu.\n\n",
    "\n\nKuudere\n\n\nA character that is cold, blunt, unemotional, cynical, and pretty much doesn't care if her beloved dies. That's what she is on the outside but she is actually caring and nice on the inside. Do not confuse this with \"Danderes\" that are just shy.\n\n",
    "\n\nLactation\n\n\nA breast that shoots milk. In Hentai Land, this doesn't automatically imply that the girl is pregnant.\n\n",
    "\n\nLamia\n\n\nA monster/animal hybrid with the upper body of a human and the lower body of a snake. to be tagged with monster girl/animal girl.\n\n",
    "\n\nLandlord\n\n\nA person or a family member who rent out property or being the building manager.\n\n",
    "\n\nLarge Breasts\n\n\nBreasts that are at least as big as the girl's head each or D-Cups+ if you were to guess their size.\n\n",
    "\n\nLatex\n\n\nA suit that is made of Latex. It's generally form-fitting.\n\n",
    "\n\nLayer Cake\n\n\nA penis is being rubbed between two vaginas. May involve alternating penetration between each vagina.\n\n",
    "\n\nLeg Lock\n\n\nThe act of wrapping the legs around your partner, most commonly during climax.\n\n",
    "\n\nLegal Loli\n\n\nA girl is over the age of majority (18 years old), but looks like a small child. Works with this tag also require the \"normal\" Loli tag. This tag is mostly used for supernatural beings that don't age such as vampires. NOTE: Don't confuse this tag with Flat Chest, which are simply adult females with small breasts. Legal Lolis have to look like actual children.\n\n",
    "\n\nLeotard\n\n\nClothing that is mostly worn for sports such as gymnastics, ballet or wrestling.\n\n",
    "\n\nLicking\n\n \nUsing the tongue as a means of sexually stimulating your partner, licking can be done just about anywhere on the body.\n\n",
    "\n\nLingerie\n\n\nThis tag is used for characters wearing skimpy underwear or erotic sleepwear. Lingerie can encompass bras, underwear of various styles, stockings, garter belts, etc. Don't use this tag for regular, \"boring\" bras and panties.\n\n",
    "\n\nLiving Clothes\n\n\nClothes that are actually monsters and abuse their wearer.\n\n",
    "\n\nLoli\n\n\nA girl that is still a preteen or barely a teenager (<14 years old) that frequents school (or not). Also used for characters that look like little girls, but are actually much older (such as Shinobu from Monogatari). Cereal Guy has a personal liking to this, wink wink. Don't tell him that this is here. NOTE: DON'T tag Lolis with \"Flat Chest\"\n\n",
    "\n\nLong Tongue\n\n\nWhen a person's tongue can reach at least from their mouth to their eyebrows.\n\n",
    "\n\nMachine\n\n\nWhen someone is bound to a mechanical device that sexually stimulates them through the use of dildos, vibrators, penis/breast pumps etc. Needs to be used along with the 'Bondage' and 'Sex Toys' tags.\n\n",
    "\n\nMagical Artifact\n\n\nAn object that bends reality to suit the user's means.\n\n",
    "\n\nMagical Girl\n\n\nA girl that devotes her life to fight the darkness with her magical powers! Most of the time in Hentai this don't end well. can be tagged with crossdressing males and cosplay.\n\n",
    "\n\nMaid\n\n\nMaid outfits are extremely popular in Japan and are frequently worn in anime and manga. Typically they include a short apron with frills and the skirt area of the dress is usually pleated.\n\n",
    "\n\nMale on Futa\n\n\nA guy is penetrating a girl with a dick. NOTE: This tag applies for both guys on Futas and guys on Shemales.\n\n",
    "\n\nMaledom\n\n\nA male sexually dominating another being. Often used in conjugation with BDSM.\n\n",
    "\n\nMales only\n\n\nThere are only males engaged in sexual acts either with themselves or with other males for these Manga and Doujins with this tag. Use it alongside the \"Yaoi\" tag. (Or not if it's Non-H)\n\n",
    "\n\nMask\n\n\nA character is wearing a mask.\n\n",
    "\n\nMassage\n\n\nA character has their body rubbed with oil/soap/lube for the purpose of relaxation and stress relief. Usually leads to erotic situations.\n\n",
    "\n\nMasturbation\n\n\nRefers to self-pleasuring. You're probably doing it right now.\n\n",
    "\n\nMegane\n\n\nMegane is the Japanese word for \"Glasses\". They can be used to help correct vision or for cosmetic purposes. Glasses include, and are not limited to: eyeglasses, spectacles, monocles, and sunglasses. This tag is used for any character wearing them, both male and female.\n\n",
    "\n\nMermaid\n\n\nAn monster/animal hybrid whose upper half of her body is human and the lower-half is a fish. To be tagged with monster girl/animal girl.\n\n ",
    "\n\nMicro\n\n\nThe opposite of Giantess. A mini boy/girl.\n\n",
    "\n\nMiko\n\n\nA character is wearing a shrine outfit when engaging in sexual acts.\n\n",
    "\n\nMILF\n\n\nShort for \"Mother I'd Like to Fuck\". A sexually attractive female who is at least in her thirties and usually several years older than her partner in the story.\n\n",
    "\n\nMilitary Uniform\n\n\nAnything involving a member of the military or someone wearing a military uniform engaging in sexual contact.\n\n",
    "\n\nMind Break\n\n\nOrgasm so hard that you lose your mind. Normally characters end up as sexual slaves mentally after their mind breaks.\n\n",
    "\n\nMind Control\n\n\nMind Control is the act of controling another person against their will. Usually this is achieved with some kind of magic or drugs.\n\n",
    "\n\nMole\n\n\nA character with a mole on their body (Face, Butt, Breast, Inner Thigh etc.)\n\n",
    "\n\nMonster\n\n\nA being that is neither human nor animal. This thing probably has a penis the size of a street lamp. NOTE: This tag is also used for the male versions of monster girls such as male Centaurs.\n\n",
    "\n\nMonster Girl\n\n\nFeaturing a girl that has characteristics of a fantastical creature (e.g: a centaur, harpy, lamia, mermaid, squid girl, plant girl, slime girl, etc.)\n\n",
    "\n\nMoral Degeneration\n\n\nRemoving a person's moral standing towards sex, effectively turning them into a loose guy or girl, a.k.a 'Slut'. More Likely to involve 'Gyaru', 'Netorare', 'Piercing', and 'Tattoo' tags. May in some cases also invoke 'Mind break' or 'Mind Control'/'Hypnosis' tags. As Todd Howard says it best: \"Degenerates\".\n\n",
    "\n\nMother\n\n\nSexual contact between a child and it's mother. DON'T use this tag if a woman just happens to be a mother and her children aren't involved in the sex scenes\n\n",
    "\n\nMouse Girl\n\n\nEither a mouse and human hybrid or a character wearing a mouse girl outfit. Can be tagged with animal boy or girl depending on the gender of the mouse hybrid. Needs to be tagged with cosplay or a animal boy/girl tag.\n\n",
    "\n\nMouth Gag\n\n\nGagging another person by inserting things into the mouth, can include foreign objects, a penis, breasts, feet, etc. Anything, really.\n\n",
    "\n\nMulti-Part\n\n\nStories told through multiple single release books.\n\n",
    "\n\nMultiple Breasts\n\n\nEverything possessing more than one pair of breasts.\n\n",
    "\n\nMultiple Insertion\n\n\nUsually tied with double penetration, insertions of foreign objects within the same hole. An example would be several dozen sharpies in Cereal Guy's fartbox. Effectively, this tag encompasses Double Vaginal, Double Anal, and triple, quadruple variations of it.\n\n",
    "\n\nMultiple Penises\n\n\nA character possessing more than one penis to please multiple women at the same time. Jealous?\n\n",
    "\n\nMuscle\n\n\nA character with a very noticeable amount of muscles typically in the abdomen or biceps region. This tag is applied to those who are overly muscular individuals.\n\n",
    "\n\nNakadashi\n\n\nA Creampie. Cumming inside of a vagina, not necessarily meaning impregnation.\n\n",
    "\n\nNaked Apron\n\n\nA person is wear nothing but an apron or only one other garment then the apron.\n\n",
    "\n\nNEET / Hikkikomori\n\n\nUsed for Shut-in characters. Can be used for both males and females.\n\n",
    "\n\nNetorare\n\n\nNetorare, often just abbreviated with NTR, is a genre where the intent is to cause an emotion of deep jealousy or distress in the reader. A direct translation of the word results in \"having your lover taken from you\" or \"to have something taken from you while you sleep.\" This is often accomplished by having the main protagonist's loved one seduced away from them, with or without their knowledge. Netorare can also encompass family members or childhood friends, not only lovers. NOTE: Don't confuse this with Netori. In Netorare, the story is told from the perspective of the one having his lover stolen or the girl being stolen away, in Netori the stealer is the MC.\n\n",
    "\n\nNetori\n\n\nNetori is similar to Netorare, but rather than the main character having their lover stolen from them, they are the ones stealing a loved person from someone else. Also, the MCs in Netori actually care about the girl they are stealing away most of the time and don't turn them into public cumdumpsters, unlike the villains in Netorare.\n\n",
    "\n\nNinja / Kunoichi\n\n\nThey often wear dark, fishnet clothing.\n\n",
    "\n \nNipple Penetration\n\n\nSexual act involving the penetration of the nipples or the breast.\n\n",
    "\n\nNo-Penetration\n\n\nBooks where no penetration take place. instead the book only contains the sexual acts of handjobs, paizuri, sumata, assjob. Note not to be tagged with Non-h.\n\n",
    "\n\nNon-H\n\n\nThis tag is used for content that has no actual sex scenes, only suggestive scenes or has a complete lack of sexy time. These works make that up by often being very funny or having a deep story.\n\n",
    "\n\nNose Hook\n\n\nA sex toy typically used with bondage and / or humiliation to give someone a pig face.\n\n",
    "\n\nNun\n\n\nA character who has devoted their life to their religion, most of the time Christianity, usually identified by the outfit they wear.\n\n",
    "\n\nNurse\n\n\nThis tag is used for galleries that contain characters that are wearing nurse outfits, though they do not necessarily need to be actual nurses. Most of these stories will take place inside of a hospital.\n\n",
    "\n\nNyotaimori/Wakamezake\n\n\nFor books that either contain food displayed on a naked persons body or Sake (Japanese alcohol) that has run through a woman's public region for drinking purposes.\n\n",
    "\n\nOffice Lady\n\n\nA lady who works in an office of some sort.\n\n",
    "\n\nOld Man\n\n\nMales that are between 30-100 that are neutral looking.\n\n",
    "\n\nOld Women\n\n\nFemales that are between 30-100 that are neutral looking.\n\n",
    "\n\nOnahole\n\n\n A japanese sex toy used to simulate a vagina.\n\n",
    "\n\nOni\n\n\nJAPANESE GOBURIN! A being with 1-2 horns on their head. Does NOT have wings or a tail. Do not confuse with Devil and/or Succubus tags\n\n",
    "\n\nOnsen\n\n\nSexual actions occurring in an Onsen (Japanese indoor/outdoor spring, or bath house).\n\n",
    "\n\nOppai Loli\n\n\nA Loli that has big breasts. Or anything other than a flat chest. NOTE: Doujins with Oppai Lolis also require the regular Loli tag.\n\n",
    "\n\nOrc\n\n\nAn orc is a fictional humanoid creature that is part of a fantasy race akin to goblins. Use this alongside the monster/monster girl tag depending on the gender.\n\n",
    "\n\nOrgasm Denial\n\n\nA character is prevented from reaching an orgasm, for example with the use of tools. Often associated with femdom.\n\n",
    "\n\nOtouto\n\n\nOtouto is the Japanese term for a little brother. Used for sex between older siblings and their younger brother\n\n",
    "\n\nOyakodon\n\n\nA mother-daughter pair is having sex with a third person. Doesn't necessarily imply incest, unless mother and daughter are heavily interacting with each other.\n\n",
    "\n\nPaizuri\n\n\nPaizuri, also known as titty-fucking or a titfuck for English speakers, involves the stimulation of the penis by the breasts. Commonly, this sex act involves the man placing his penis in the woman's cleavage and thrusting between the breasts while they are squeezed together. Frequently combined with oral sex.\n \n",
    "\n\nPajamas\n\n\nPajamas, or PJs for short, are clothes you wear to bed. They are often made of flannel and really comfy.\n\n",
    "\n\nPantyhose\n\n\nClose-fitting legwear, which cover the wearer's body from the waist to the feet. Mostly considered to be a woman's and girl's garment.\n\n",
    "\n\nParasite\n\n\nA parasite that infects the character's body as a manner to either induce sexual stimulation, or as a host for its breed. Usually paired with Alien, Possession, Mind Control, and/or Monster tags.\n\n",
    "\n\nPegging\n\n\nThe act of a woman penetrating the ass of a man with some inanimate object. Usually involves some kind of sex toy (strap-on, dildo, vibrator, etc...) and is often associated with femdom and bondage play.\n\n",
    "\n\nPet Girl\n\n\nSomeone is treating a girl as if she was a pet. Doesn't necessarily have to be an animal girl.\n\n",
    "\n\nPhimosis\n\n\nThe foreskin of the affected person is too tight to be retracted behind the head of the penis. Oftentimes this tag is associated with Shotas or male virgins.\n\n",
    "\n\nPhone Sex\n\n\nTo be tagged with all books containing either normal phone sex and having sex while talking on the phone with someone while engaging in sexual acts with another person.\n\n",
    "\n\nPiercings\n\n\nAny form of piercing besides earrings. Don't use this tag for earrings unless you want to look dumb. You don't want to look dumb.\n\n",
    "\n \nPig\n\n\nA pig engages in sex. Not to be used for Orcs or similar monsters. Has to be used alongside the Bestiality tag.\n\n",
    "\n\nPlant Girl\n\n\nA monster that is half human, half plant. Usually associated with the Tentacles tag. Needs to be tagged along with the monster/Monster Girl tag depending on the gender.\n\n",
    "\n\nPlump\n\n\nA girl that is plump/thick, but not hugely oversized. Needs to be tagged along with the BBW tag, as it is a ramification of such.\n\n",
    "\n\nPolice Uniform\n\n\nA uniform of a police officer. Now cuff me, officer, wink.\n\n",
    "\n\nPonytail\n\n\nA girl (usually) has her hair tied up into a ponytail\n\n",
    "\n\nPossession\n\n\nA character is being possessed by another entity and forced to do things against their will. Usually tied with Mind Control and/or Ghost tags.\n\n",
    "\n\nPregnant\n\n\nWorks that contain erotic depictions of women who are pregnant. Only tag this if there is a sex scene with a pregnant woman. Don't use it if she's just shown with a pregnant belly on the last page. Use \"Impregnation\" for that instead.\n\n",
    "\n\nPrison\n\n\nCharacters are interacting with each other in a prison.\n\n",
    "\n\nProlapse\n\n\nA character was fucked so hard that their womb or anus has fallen out of their respected orifice. This is a rather extreme fetish.\n\n",
    "\n\nProstate Massage\n\n\nSexual stimulation of the anterior, rectal wall or perineum, typically in a submissive context.\n\n",
    "\n\nProstitution\n\n\nA person is selling sex, regardless of gender. Not always for money, can be sold for favours or material goods.\n\n",
    "\n\nRace Queen\n\n\nThe really hot Japanese women who advertise products,(often cars)in Japan by standing there and being incredibly hot.\n\n",
    "\n\nRandoseru\n\n\nA randoseru is a firm-sided backpack made of stitched firm leather or leather-like synthetic material, most commonly used in Japan by elementary schoolchildren (grades 1 to 6). Only use this tag if they are still wearing one while having sex.\n\n",
    "\n\nRape\n\n\nWhen a male has sexual intercourse with an unwilling participant with or without the use of force. Usually, he does use force.\n\n",
    "\n\nReptilian\n\n\nTwo types, first a monster/animal hybrid that is part reptile part human. Commonly seen with scales and long tongues. second Refers to anthromorphic reptiles possessing human personalities and characteristics\n\n",
    "\n\nReverse Harem\n\n\nWhen there are men having an intercourse with a single woman. This only applies to actual harems, where the men are\nactually the woman's lovers. If it's just a normal rape scene or orgy, just use the Group Sex/Gangbang tags.\n\n",
    "\n\nReverse NTR\n\n\nNTR situations where a guy is stolen away instead of a girl. Applies for both Reverse Netorare (you have the POV of the guy getting stolen) and Reverse Netori (POV of the girl stealing him), since there is very little content of either\n\n",
    "\n\nReverse Rape\n\n\nWhen a female has sexual intercourse with an unwilling participant with or without the use of force. Often appears alongside Femdom and Yandere tags.\n\n",
    "\n\nRobot Girl\n\n\nA robot or android that posses intelligence, though commonly seen as a female tag this does apply to male robots as well.\n\n",
    "\n\nRoleplay\n\n\nOne or more characters are pretending to be a character or character archetype they aren’t. Can oftentimes be seen alongside the Cosplay tag, but the two aren’t mutually inclusive.\n\n",
    "\n\nRoyalty\n\n\nA character that is noble, e.g. a princess or queen.\n\n",
    "\n\nRyona\n\n\nA character is getting beat up violently. Shiruka Bakaudon loves to draw this.\n\n",
    "\n\nSalaryman\n\n\nThe male equivalent of office lady, to be tagged for male office works in the commonly seen suit.\n\n",
    "\n\nScar\n\n\nA character has a scar on their body.\n\n",
    "\n\nScat\n\n\nPOOP EVERYWHERE! It's a love/hate thing.\n\n",
    "\n\nSchool Swimsuit\n\n\nSwimwear intended for use by school students during swimming lessons in Japan. They can come in the form of either a one-piece or a two-piece swimsuit for girls, the latter of which corresponds to a sleeveless shirt for the upper torso. School Swimsuits also require the regular \"Swimsuit\" tag\n\n",
    "\n\nSchool Uniform\n\n\nA uniform used in public or private schools. It can be taken of, or worn, depending on how you like it.\n\n",
    "\n\nSelfcest\n\n\nA character is having sex with him/herself, via clones or through parallel universes\n\n",
    "\n\nSex Toys\n\n\nA sex toy is an object or device that is primarily used to facilitate sexual pleasure. The most popular sex toys are designed to resemble human genitals and may be vibrating or non-vibrating.\n\n",
    "\n\nShared Senses\n\n\nUsed for any situation where a character shares their senses with something or someone else.\n\n",
    "\n\nSheepgirl\n\n\nEither a sheep and human hybrid or a character wearing a sheep girl outfit. Tagged with animal boy or girl depending on the gender of the sheep hybrid. Needs to be tagged with cosplay or a animal boy/girl tag.\n\n",
    "\n\nShemale\n\n\nA character possessing breasts and that looks like a female, but possesses a penis instead of a vagina. Unlike Futanari, it doesn't have a vagina. NOTE: The \"Futa on ...\" tags encompass both Futas and Shemales since it's too much hassle to create separate \"Shemale on ...\" tags. HOWEVER, DON'T use the general Futanari tag for Shemales and vice versa.\n\n",
    "\n\nShibari\n\n\nRope tied artistically around the torso, creating distinctive patterns. Use it alongside the \"Bondage\" tag.\n\n",
    "\n\nShimaidon\n\n\nTwo sisters are having sex with a third person. Doesn't necessarily imply incest, unless they are are heavily interacting with each other or their sex partner is also related to them.\n\n",
    "\n\nShimapan\n\n\nShimapan is an abbreviation of shima-pantsu (striped panties), and one of the new moe fashions to sweep the otaku landscape. One of the most iconic things about Japanese girls.\n\n",
    "\n\nShort Hair\n\n\nA girl has hair that does not reach past her shoulders. NOTE: Should not be used for male characters.\n\n",
    "\n\nShota\n\n\nShotacon (Shota), Manga are depicting a sexual relationships between young boys or between a young boy and an adult. Use this tag for content where males are preteens or barely teenagers.\nNOTE: ONLY use this tag for Yaoi and Futa on Male or Male on Futa content. For straight sex, use the \"Straight Shota\" tag instead.\n\n",
    "\n \nSick / Sickness\n\n\nA person who is actually sick or has a frail body that can get sick pretty easy.\n\n",
    "\n\nSixty-Nine\n\n\nThe reference is that the numerals 6 and 9 are inverted versions of each other, reflecting the physical position that the couple must adopt when engaged in this sexual practice and pleasure each other orally.\n\n",
    "\n\nSkinship\n\n\nBonding / clinging through physical contact.\n\n",
    "\n\nSlave\n\n\nForcing a person to be submissive and treat them as a slave during sex. If it's consensual, use the \"BDSM\" tag instead.\n\n",
    "\n\nSleeping\n\n\nHaving sex with a sleeping person. You need the skills of a ninja to successfully pull this off.\n\n",
    "\n\nSlime\n\n\nA creature whose body is made of liquid or a living mass of liquid. Should not be confused for the Slime Girl tag. Can be associated with the 'Tentacles' tag. Use this alongside the 'Monster' and/or 'Alien' tags.\n\n",
    "\n\nSlime Girl\n\n\nA slime girl (a monster girl) who has a liquid form. All lubed up and ready to go. Needs to be tagged with monster girl.\n\n",
    "\n\nSlut\n\n\nA character with an insatiable lust and no commitment to a single person.\n\n",
    "\n\nSmall Breasts\n\n\nBreast size between Cup A and Cup C. Not to tag with Flat Chest or Loli.\n \n",
    "\n\nSmall Penis\n\n\nA penis that's significantly smaller than average. Only tag it if it's smaller than a character's index finger.\n\n",
    "\n\nSmegma\n\n\nThe secretion of the sebaceous gland, more specifically : The cheesy sebaceous matter that collects between the glans of the penis and the foreskin or around the clitoris and labia minora.\n\n",
    "\n\nSmell\n\n\nThe act of emitting strong, sensational smells.\n\n",
    "\n\nSmug\n\n\nA character is having or showing an excessive pride in oneself, typically featuring narrowed eyes and a condenscending look.\n\n",
    "\n\nSnuff\n\n\nA character is killed or dies. Not necessarily includes Guro.\n\n",
    "\n\nSolo Action\n\n\nOne character engages in a sexual activity by themselves. The use of sex toys or similar objects as stimulus is acceptable as well. Other characters may be present, but no physical or mental interaction may occur for this tag.\n\n",
    "\n\nSoushuuhen\n\n\nA Soushuuhen is an official compilation of a doujinshi series. DON'T confuse this with Tankoubons, which are official commercial books sold by publishers.\n\n",
    "\n\nSpanking\n\n\nSlapping that butt cheek till it's raw and red. Usually tied with BDSM.\n\n",
    "\n\nSpats\n\n\n Also known as \"compression\" or \"bike shorts,\" spats are a skin-tight fabric that start at the waist and end at the thighs. They are typically worn as workout attire and emphasize the thigh region. Needs to be tagged along 'Sportswear' tag.\n\n",
    "\n\nSpitroast\n\n\nA sexual activity involving 3 people, two active males (or Futas) and one passive (male or female). Man 1 penetrates person 2 from the rear (anal or vaginal) while he/she sucks the penis of person 3.\n\n",
    "\n\nSportswear\n\n\nOutfits or uniforms worn by someone participating in a sport or exercising. Used prominently together with 'Spats' and 'Bloomers'.\n\n",
    "\n\nSpreading\n\n\nA person is spreading their vagina and/or anus on their own, be it with their fingers or with an object, to invite one for sex.\n\n",
    "\n\nSquid Girl\n\n\nA girl that is half human/half squid. to be tagged with animal girl/animal boy and monster girl/monster depending on the gender.\n\n",
    "\n\nSquirting\n\n\nA female produces vast quantities of lovejuice during sex, generally during an orgasm. Can behave like a 'spray' or some sort of 'leak'.\n\n",
    "\n\nStalking\n\n\nThe act of stalking a person. Watching closely every move that she makes and making a dossier about it. This can be used along with the Blackmail tag. Or a Yandere.\n\n",
    "\n\nStockings\n\n\nStockings, also referred to as thigh-highs or knee-socks, are a close-fitting, elastic garment covering the leg and going above the knee. Stockings vary in color, design and transparency. All women should wear stockings, because they are awesome.\n\n",
    "\n\nStomach Bulge\n\n\nA solid object pushing against the stomach from the insides. Often caused by large insertions or huge penises.\n\n",
    "\n\nStory Arc\n\n\nA longer story that is told over at least 60 pages or 3 chapters within the same gallery or book. You can use this tag to differentiate tankoubons that are collections of oneshots and tankoubons that focus on a single story.\n\n",
    "\n\nStraight Shota\n\n\nYoung boys (usually <14 years old) have sex with a woman, no matter her age. NOTE: ONLYuse this tag for straight sex. For Yaoi and Futa on Male or Male on Futa content use the \"Shota\" tag instead.\n\n",
    "\n\nStrap-on\n\n\nA dildo that is used by women. It has a device so it can be \"strapped\" on. Mainly used for lesbian sex to imitate a penis.\n\n",
    "\n\nStuck in Wall\n\n\nA character is stuck in a wall or similar object and is getting fucked while being unable to move.\n\n",
    "\n\nSumata\n\n\nThe action of rubbing a penis between thigh, labia, or both for satisfaction.\n\n",
    "\n\nSundress\n\n\nAn informal dress of a lightweight fabric, usually loose fitting, worn without a layering top.\n\n",
    "\n\nSweater\n\n\nA knitted garment, either long/short sleeved or sleeveless and (usually with a turtleneck), that emphasizes the \"physique\" of its wearer.\n\n",
    "\n\nSweating\n\n\nVisually visible sweat on the body and sometimes glossy bodies in colored doujinshi (Not to be confused with characters being wet from the partners or their own love juices)\n\n",
    "\n\nSwimsuit\n\n\nA tag used for a person wearing a woman's bathing suit. This tag is used for all kinds of swimsuits, including bikinis or one-piece swim wear.\n\n",
    "\n\nSwinging / Netorase\n\n\nA character is willingly letting his partner have sex with someone else. This tag applies both for Swinging where partners are swapped and Netorase, where just one partner is having sex with someone else with their partner watching.\n\n",
    "\n\nSymbol Shaped Pupils\n\n\nLike hearts in her eyes? This is it. Also used for other forms like stars.\n\n",
    "\n\nTailjob\n\n\nA tail is being used to stimulate a genital area.\n\n",
    "\n\nTall Girl\n\n\nA tall woman that should be at least one head bigger than her partner. Note: Should not be tagged if the character qualifies as giantess or if the partner is a Shota or Loli.\n\n",
    "\n\nTan\n\n\nUsed for tanned characters. A tan leaving bronze colored skin for your viewing pleasure.\n\n",
    "\n\nTankoubon\n\n\nA full commercial book by one artist or a duo (with optional guest artists at the end). Usually, it's either a collection of oneshots or a longer story with a few oneshots at the end.\n\n",
    "\n\nTanlines\n\n\nTanlines refers to a division between areas on the skin of pronounced paleness relative to other areas of skin that have been suntanned and are noticeably darker. NOTE: Also requires the regular Tan tag.\n\n",
    "\n\nTattoo\n\n\nInvolves tattoos of some sort on the characters. The coolest kinds of tattoos are the full-back tattoos worn by Yakuza. Don't confuse this with Body Writing or Body Painting.\n\n",
    "\n\nTeacher\n\n\nThe teacher tag is used for Manga that contain teachers who are most often in dominant positions over their students. The Japanese word for teacher is Sensei and it is commonly used as the translation to describe them in Anime and Manga.\n\n",
    "\n\nTengu\n\n\nTengu are japanese youkai that are said to inhabit the mountais and forests, and possess the power of the divine winds. It's common to have them drawn as a bird-like person (with wings and such, e.g Aya Shameimaru from Touhou Project), but they can appear in wolf-like forms as well (e.g Momiji Inubashiri also from Touhou Proiect). Usually tied with the Monster girl and/or Monster tags.\n\n",
    "\n\nTentacles\n\n\nInvolves some sort of tentacle and penetration. Mmmmmmm..... Delicous.\n\n",
    "\n\nTextless\n\n\nImage set without any dialogue, text or sometimes story.\n\n",
    "\n\nThreesome\n\n\nRefers to sex scenes with exactly three participants, regardless of their gender. This tag needs to be used alongside the \"Group Sex\" tag.\n\n",
    "\n\nTickling\n\n\nTo touch or stimulate a person or a part of the body in a way that causes mild discomfort as to provoke laughter.\n\n",
    "\n\nTime Stop\n\n\nStopping time to have sex with an individual. Or to deal with justice as Stopman does.\n\n",
    "\n\nToddler\n\n\nA very young child (less than 5 years old), usually tender.\n\n",
    "\n\nTomboy\n\n\nA tomboy is a girl who exhibits characteristics or behaviors considered typical of the gender role of a boy, including wearing typically masculine-oriented clothes and engaging in games and activities that are often physical in nature, and which are considered in many cultures to be the domain of boys.\n\n",
    "\n\nTorn Clothing\n\n\nPartial or complete destruction of clothing covering the upper or lower areas either rudely preparing the character for sex or even during the act, most often involving some form of attack. Please do not use simply for torn holes in stockings.\n\n",
    "\n\nTorture\n\n\nThe ancient art or inflicting great physical, mental, and/or emotional pain on somebody for information, as punishment, or just sheer sadistic pleasure. NOTE: DON'T confuse this with the \"Ryona\" tag. Torture is a step above that.\n\n",
    "\n\nTransformation\n\n\nWhen a character is submitted to any physical change. Example: Turning in a monster, turning into a devil.\n\n",
    "\n\nTransparent Clothing\n\n\nClothes that are transparent. Or just melt away, leaving you to take a good look at something.\n\n",
    "\n\nTrap\n\n\nA trap refers to a male character that is dressed up as a female; this often leads to Yaoi or being dominated by a more powerful partner. In most cases, the male character has very feminine characteristics and could be confused for a female.\n\n",
    "\n\nTribadism\n\n\nSex involving women rubbing their vulvas against each other.\n \n",
    "\n\nTsundere\n\n\nTsundere is a Japanese character development process which describes a person who is initially cold and even hostile towards another person before gradually showing their warm side over time. The word is derived from the terms \"tsun tsun\", meaning to turn away in disgust, and \"dere dere\", meaning to show affection. \"It's not like I like you, b-baka!\"\n\n",
    "\n\nTutor\n\n\nTutors are similar to teachers, but teach privately within the homes of their students.\n\n",
    "\n\nTwins\n\n\nIdentical siblings, born on the same day and time. Can be of the same gender or separate ones.\n\n",
    "\n\nTwintails\n\n\nA girl (usually) has her hair tied up into pig tails. Like this: /\\\n\n",
    "\n\nUgly\n\n\nCharacters that are bad looking.\n\n",
    "\n\nUnbirthing\n\n\nA character is getting back to the place where babies come from. Must be tagged along with \"Vore\". Often involves Giantesses and / or Mini Boys.\n\n",
    "\n\nUncensored\n\n\nWorks that have not been edited or decensored. Uncensored works contain original artwork before censorship was applied. Do not confuse it with the \"Decensored\" tag.\n\n",
    "\n\nUncle\n\n\nAn uncle is having sex with his nephew or niece. Must be used along with Incest.\n\n",
    "\n\nUrethra Insertion\n\n\nInserting things into the urethra, an example would be a shoe, a bottle, a finger, Cereal Guy's spoon.\n\n",
    "\n\nVampire\n\n\nA corpse supposed to leave its grave at night to drink the blood of the living by biting their necks with long pointed canine teeth. Can get pretty kinky. to be tagged with monster/monster girl depending on gender.\n\n",
    "\n\nVanilla\n\n\nThe opposite of kinky. Normal Sex.\n\n",
    "\n\nVirginity (Male)\n\n\nWhen the guy is or was still a virgin before the sex occured. Often occurs along with the Phimosis tag. NOTE: DON'T confuse this with \"Defloration\". Use this tag when males lose their virginity. For females, use Defloration.\n\n",
    "\n\nVomit\n\n\nVOMIT EVERYWHERE! Some people are into puke, some aren't.\n\n",
    "\n\nVore\n\n\nShort for \"voraphilia\" or \"vorarephilia\": a fetish in which one fantasizes about being eaten alive or eating another creature alive as pleasure.\n\n",
    "\n\nVoyeurism\n\n\nThe practice of taking pleasure in observing something private, sordid, or scandalous. this can be for a person watching a sexual act being committed by others with or without their knowledge often with the person watching engaging in masturbation. Also used for people who gain satisfaction/happiness from watching the person they like excessively.\n\n",
    "\n\nWaitress\n\n\nSomeone who serves in a bar or resturant. NOTE: Your penis does count as the tip. Okay, okay, I'm sorry, I'm done.\n\n",
    "\n\nWatersports\n\n\n A character leaks pee, mostly during orgasm or to humiliate their partner.\n\n",
    "\n\nWedding Gown\n\n\nA character is wearing a wedding gown while having sex.\n\n",
    "\n\nWestern\n\n\nUsed for any gallery whose artist is not based in Asia. Note that we only allow such uploads if they still have a Manga style.\n\n",
    "\n\nWidow\n\n\nA woman who has lost her spouse because he died and has not married again.\n\n",
    "\n\nWings\n\n\nUsed for any character that is wearing wings. NOTE: Should NOT be tagged on harpies, since it's already expected for them to have wings.\n\n",
    "\n\nWitch\n\n\nGirls that practice witchcraft and magic. Don't let them stick a wand up your ass.\n\n",
    "\n\nWormhole\n\n\nUse of scientific or magical means to have sexual intercourse over extended or long distances (like portals n' stuff). Other way to describe it would be a \"long distance glory hole\". Do not confuse this with 'Stuck in Wall', 'Glory Hole', or 'Shared Senses' tags. Can be associated with the 'Masturbation', 'Handjob' and 'Blowjob' tags.\n\n",
    "\n\nX-ray\n\n\nWhen penetration is being made visible through the flesh, giving you a HD look at what's really going on.\n\n",
    "\n\nYandere\n\n\nYandere is a Japanese term for a person who is initially loving and gentle before their devotion becomes destructive in nature, often through violence. The term is derived from the words \"yan\", meaning a mental or emotional illness, and \"dere dere\", meaning to show affection. Yandere characters are mentally unstable, often using extreme violence as an outlet for their emotions. Often tagged along with Rape or Reverse Rape.\n\n",
    "\n\nYaoi\n\n\nYaoi, also known as \"Boys' Love\" (commonly abbreviated as \"BL\"), is a popular Japanese term for female-oriented fiction that focus on homoerotic or homoromantic male relationships, usually created by female authors. The two participants in a yaoi relationship are often referred to as \"Seme\" (the top) and \"Uke\" (the bottom). sehki loves his Yaoi Shota doujins.\n\n",
    "\n\nYuri\n\n\nYuri, also known as \"Girl's Love,\" is a genre and theme of Manga and Anime involving love between women. The term \"yuri\" directly relates to the flower called \"lily\" in English and can be a theme or pun in various works as well as a person's name. Yuri can focus either on the sexual, the spiritual, or the emotional aspects of the relationship, the latter two sometimes being called Shojo-Ai.\n\n",
    "\n\nZombie\n\n\nIf you're into necrophilia, but still want some moving... Needs to be tagged with monster/monster girl tag depending on gender.\n\n"
  ]